---
title: Обо мне
date: '2018-07-08 19:53:22'
slug: about
---

Привет, я Влад (Известен как @amd\_nick или \_AMD\_). Почти всю жизнь провел за компом, не выходя из дома. Занимался всем подряд - от "хахакерства" и сайтиков на Ucoz до администрирования и программирования, пока в 2018 году не вышел из дома и не начал жить

Пишу это и чувствую себя в клубе анонимных задротов. Давай еще раз, я же излечился, ну!

Я Владик, 21 годик и я обезьяна, практикующая лишь один язык программирования - Lua, но при этом считаю, что делаю это хорошо (Правда я почему-то [всегда так считал](https://t.me/boxie/146), а через месяц ломал лицо фейспалмом). За 5 лет круглосуточной разработки на обезьяньем языке (почти как PHP!) написал несколько сотен мини-скриптов и приложений и вообще различных ништяков для бекенда (ненавижу фронтенд) и теперь чувствую себя Богом, потому что самозванец внутри говорит, что я могу все.

## Работа

Работаю никем, сижу на шее у мамы, потому что я же модный хипстер и предпочитаю свободу материальным благам (написано с MacBook!). Ну а вообще, я бы пошел к кому-то на работу даже за еду, лишь бы задача была интересной. Или даже доплачу за это!

Еще я мамкин инвестор. Да, я знаю, что такое биткоин и даже шиткоин и у меня есть и то и то и я верю в блокчейн и вообще у меня есть наработки проекта, связанного с ним, вот это дааа. Возьмите меня в финтех, пожалуйста

## Проекты или как щас модно говорить?

- [Пара игровых серверов](https://vk.com/trigonim) в Garry's Mod
- [Автодонат в той же игре](gmdonate-how-to), чтобы крутые ребята могли вместо срачей с донатерами развивать проекты, попивая смузи
- Ну допустим этот non-profit блог
- Ну допустим канал [t.me/uFeed](https://t.me/uFeed), где я вкратце пишу о том, что читаю и помогаю людям экономить время
- Ну допустим канал [t.me/boxie](https://t.me/boxie), где я высокомерно пишу то, что хочу
- А еще люблю писать бесплатных [ботов для Telegram](my-telegram-bots)

## Профессиональные навыки

Помимо разработки я увлекаюсь системным администрированием (даже знаю слово Docker и CI!), психологией, копирайтингом (ха-ха), маркетингом, SMM и тайм менеджментом. Люблю раскладывать все по полочкам и на организацию информации порой у меня уходит времени больше, чем на сон, потому что узнал о перфекционизме еще до того, как это стало мейнстримом и знаю, что это проклятье, а не модная фича!1!!

:::note GitHub

Иногда тут пишу всякий код: [GitHub](https://github.com/AMD-NICK)

:::

## Цель

Ну я люблю путешествовать и пить. Шучу, не путешествовать.
Программирование на самом деле это не мое признание, скорее хобби, как и администрирование, тайм менеджмент и прочие прикольные слова. Вообще мне интересен бизнес и я бы хотел открыть свою сеть моднячих IT заведений, в которых были бы всякие гиковские приколюхи, типа опен сорса, только с блекджеком и шлюхами, когда любой мог бы написать "плагин" для заведения или всей сети, т.е. сделать свой вклад.

* * *

## Контакты

- ✈️ [Telegram](https://t.me/amd_nick) – если первое сообщение это "Привет" без сути, то могу не ответить
- 📸 [Instagram](https://instagram.com/amd_nick) – иногда тут фоточки выкладываю
- 🎮 [Steam](https://steamcommunity.com/profiles/76561198071463189) – играю всякое. Перед добавлением лучше писать на стене
- 🐦 [Twitter](https://twitter.com/amd_nick) – явно не мой формат :(
- 👮‍♀️ [VK](https://vk.me/amd_nick) – чисто для работы и токсичных комментов
- [YouTube](https://www.youtube.com/user/AMDMin) | [KinoPoisk](https://mykp.ru/amd) | [Nickname](https://nick-name.ru/nickname/amd)
